{
    "name": "Man Ka Chun - Cyrus",
    "title": "IT Portfolio",
    "country": "Macau",
    "location": "Macau",
    "itemIntro": "SUMMARY",
    "hobby": "Photography , Hiking",
    "cv": "https://drive.google.com/file/d/1bGcjm6XX7spKAQ5SzNokxCiyUhtsBMXT/view?usp=drive_link",
    "intro": "Cyrus aspires to be a Full-Stack Engineer and has earned his IT diploma in Osaka, Japan, graduating in March 2025. He has since moved to Hong Kong. Before his shift to the IT field, he was involved in the video production sector, working as a video editor, photographer, and multimedia designer, with an emphasis on visual media and commercial video production.",
    "frontTitle": "Frontend",
    "backTitle": "Backend",
    "dbTitle": "Database",
    "otherTitle": "Other",
    "email": "cyrusman2025@gmail.com",
    "companyList": {
        "wiz": {
            "companyName": "WIZ Technology Co. Ltd（Macao）",
            "workTitle": "Programmer",
            "timeRange": "2025/11 - Now",
            "p1": "Developed frontend for enterprise payroll system using Next.js 14 (Turbopack) and company base module, implementing UI and interactions for salary calculation and report generation.",
            "p2": "Built frontend for government internal e-card bulk sending system using Next.js (Turbopack) and company base module, creating interfaces for bulk sending, template management, sending records, and access control.",
            "p3": "Styled components with Tailwind CSS and RizzUI for responsive design, utilized Turbopack for faster development, and participated in code reviews and API integrations."
        },
        "sjm": {
            "companyName": "SJM Holdings Limited（Macao）",
            "workTitle": "Senior Multimedia Designer",
            "timeRange": "2018/09 - 2020/04",
            "p1": "In SJM Holdings’ marketing department, tasked with producing promotional videos to highlight Macau’s unique events as a local gaming enterprise.",
            "p2": "Create TV commercials, YouTube channel content, and event promotion/record videos to enhance brand visibility and engagement.",
            "p3": "Within a 3-person team, conceptualised, filmed, and edited videos, incorporating motion graphics to enhance visual appeal using professional tools.",
            "p4": "Produced an average of 3 YouTube videos and 2 event record videos or highlight videos monthly, increasing event participation by 20%."
        },
        "fhia": {
            "companyName": "AhctGroup - FHIA（Macao）",
            "workTitle": "Product Photographer",
            "timeRange": "2017/03 - 2018/03",
            "p1": "Promotion video and event photos shooting.",
            "p2": "Created motion graphic video of promotion."
        },
        "autoEdit": {
            "companyName": "AutoEdit.Ltd（Hong Kong）",
            "workTitle": "Production Assistant",
            "timeRange": "2016/09 - 2017/02",
            "p1": "Advertising and event video shooting.",
            "p2": "Promotion video and event photos shooting."
        }
    },
    "eduction": {
        "japanese": {
            "sj_name": "ECC Kokusai College Of Foreign Languages",
            "sj_timeRange": "2020/10 - 2022/03"
        },
        "it": {
            "si_name": "ECC College Of Computer and Multimedia",
            "si_timeRange": "2022/04 - 2025/03"
        }
    },
    "portfolio": {
        "year1": {
            "title": "Year1 - Portfolio 2022 Website",
            "msg": "This portfolio website was created during my first year at Osaka ECC Computer School, where I learned HTML, CSS, and JavaScript, and managed it using Firebase Hosting."
        },
        "year2": {
            "title": "Year2 - Individual Creation Project",
            "intro1a": "A New Wave of Dating Apps!",
            "intro1b": "Dating Date",
            "intro1c": "Find Your Perfect Match",
            "title2": "Revolutionary Matching System",
            "intro2a": "Instead of traditional profiles and swiping, Dating Date uses a unique question-based system to find your perfect match based on shared interests and hobbies.",
            "intro2b": "Actively search for up to 3 matches by matching users based on criteria in the database. With Dating Date, there are endless possibilities for finding your perfect match.",
            "title3": "Local System"
        },
        "year3": {
            "portfolio2024": {
                "title": "Year3 - Portfolio 2024 Website",
                "intro": "I have created a portfolio website by self-learning React. Compared to Version 1, this version has significant changes in UI/UX and includes animations to display the content. I also made a mobile version, which is simpler in display compared to the desktop version. Currently, it is hosted on Vercel with integration to GitHub."
            },
            "careconnect": {
                "c_title": "Year3 - First Semester Team Project",
                "c_intro1": "Care Connect",
                "c_intro2": "NFC Emergency Information System",
                "c_intro3": "Using NFC technology to quickly notify rescuers and family members in emergencies and provide patient information. This digitizes data for people with disabilities, allowing easy access to data during regular check-ups, greatly enhancing convenience.",
                "c_title3": "Online System",
                "c_workloadTitle": "Responsibilities for this project",
                "c_workload": "React.js, Go support, screen design, AWS setup"
            }
        }
    }
}